<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Product;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $products = [

            [
                'name' => '(MG)ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'title' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา',
                'ProductCategoryID' => '1',
                'description' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'image' => 'kage.jpg',
                'stock' => 999,
                'price' => 500
            ],
            [
                'name' => '(LN) คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ เล่ม 2',
                'title' => 'คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ',
                'ProductCategoryID' => '2',
                'description' => '(LN) คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ เล่ม 2',
                'image' => 'tsujo_2_cover.jpg',
                'stock' => 999,
                'price' => 228
            ],
            [
                'name' => '(LN) Special Set คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย เล่ม 3',
                'title' => 'คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย',
                'ProductCategoryID' => '2',
                'description' => '(LN) Special Set คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย เล่ม 3',
                'image' => 'russia.jpg',
                'stock' => 999,
                'price' => 895
            ],
            [
                'name' => '(LN) ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน เล่ม 1',
                'title' => 'ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน',
                'ProductCategoryID' => '2',
                'description' => '(LN) ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน เล่ม 1',
                'image' => 'yokoso.jpg',
                'stock' => 999,
                'price' => 256
            ],
            [
                'name' => '(LN) มุมมองนักอ่านพระเจ้า เล่ม 6',
                'title' => 'มุมมองนักอ่านพระเจ้า',
                'ProductCategoryID' => '2',
                'description' => ' [สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ]
                คือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’
                เขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน
                และรู้ว่าเรื่องนี้จะจบลงอย่างไร
                .
                ดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย
                ท่ามกลางความหายนะต่างๆ นานา
                และ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์
                คิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน
                แต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน
                .
                โลกเปลี่ยนแปลงไปแล้ว
                และนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย
                ก็ค่อยๆ เปลี่ยนแปลงไป เพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน
                .
                ปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้ว
                คุณล่ะ … พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง',
                'image' => '6.jpg',
                'stock' => 999,
                'price' => 295
            ],

        ];
        foreach ($products as $key => $value) {
            Product::create($value);
        }
    }
}