<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Product;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $products = [

            [
                'name' => '(MG)ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'title' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา',
                'ProductCategoryID' => '1',
                'description' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'image' => 'kage.jpg',
                'stock' => 999,
                'price' => 500
            ],
            [
                'name' => '(MG) ชีวิตไม่ง่ายของนางร้าย LV99 -ฉันคือบอสลับค่ะ ไม่ใช่จอมมาร- เล่ม 1',
                'title' => 'ชีวิตไม่ง่ายของนางร้าย LV99 -ฉันคือบอสลับค่ะ ไม่ใช่จอมมาร- เล่ม 1',
                'ProductCategoryID' => '1',
                'description' => 'เรื่อง: ซาโตริ ทานาบาตะ ฉันเกิดใหม่เป็นยูมิเอลา นางร้ายในเกมจีบหนุ่ม RPG แม้ตามเนื้อเรื่องจะเป็นตัวละครแสนจืดชืด แต่หลังฉากจบ ยูมิเอลาจะปรากฎตัวอีกครั้งในฐานะบอสลับแล้วเข้าห้ำหั่นกับผู้กล้า—กล่าวคือเก่งสุดๆ! ผลจากการฝึกฝนด้วยจิตวิญญาณเกมเมอร์อันพลุ่งพล่าน ตอนที่เข้าศึกษาในโรงเรียนฉันก็เลเวล 99 ไปซะแล้ว เดิมทีตั้งใจว่าจะใช้ชีวิตอย่างสงบสุขและไม่ข้องเกี่ยวกับเนื้อเรื่องเกม ทว่าเพราะความแตกเรื่องเลเวลตั้งแต่เข้าโรงเรียน เธอจึงถูกนางเอกกับพวกเป้าหมายในการจีบสงสัยว่าเป็นจอมมาร...!?
                ',
                'image' => '_m_akuyaku_reijo_mg_vol1_jacket_cover.jpg.jpg',
                'stock' => 999,
                'price' => 137.75
            ],
            [
                'name' => '(LN) คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ เล่ม 2',
                'title' => 'คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ',
                'ProductCategoryID' => '2',
                'description' => '“ดูสิๆ ม่าคุง คุณแม่ทำสำเร็จแล้วละจ้ะ!” “...นี่นาย” “...อย่าพูดนะ เดี๋ยวได้ร้องไห้กันพอดี” มารดาที่ตามติดเข้ามาในเกมอย่างมามาโกะช่างแข็งแกร่งเป็นที่สุด... แข็งแกร่งเกินไปจนพวกลูกๆ อย่างมาซาโตะแทบหมดคุณค่าในการมีชีวิตอยู่ พวกเขาจึงตัดสินใจทำเควสต์เข้าโรงเรียนเพื่อให้ได้รับไอเท็มเสริมแกร่งมาไว้ในครอบครอง มาซาโตะใจเต้นไม่เป็นส่ำเมื่อได้รู้จักกับเมดี้ สาวน้อยจอมเวทรักษา ชั่วขณะที่คิดว่าจะได้ใช้ชีวิตรักวัยรุ่นสุดละมุนให้สมเป็นเด็กหนุ่มวัยกำลังโตเสียที... “คุณแม่ลองใส่ดูน่ะจ้ะ เป็นไงจ๊ะ เข้ากันไหมเอ่ย” มามาโกะก็ยังตามมาเข้าเรียนด้วยอยู่ดี!? ใส่ชุดนักเรียนกะลาสีมาเข้าร่วมคาบเรียนไม่พอ ยังใส่ชุดว่ายน้ำโรงเรียนปรากฏตัวขึ้นที่สระว่ายน้ำอีก!? คุณแม่โซฮ็อตจนเหล่าเด็กผู้ชายพากันแย่งสารภาพรัก ซ้ำยังลงประกวดเวทีนางงามในเทศกาลโรงเรียน!? เบื้องหลังความวายป่วงของมารดาที่พาลูกชายอยากร่ำไห้ เมดี้คนสวยที่มาซาโตะแอบปลื้มยังแบกรับความกลัดกลุ้มด้วยปัญหามารดาอยู่ในใจ... แล้วมีหรือที่ผู้กล้าอย่างมาซาโตะจะยอมเพิกเฉย! ...แน่นอน คุณแม่ของผู้กล้าอย่างมามาโกะก็เช่นกัน เรื่องราวซาบซึ้งสุดฮาชวนน้ำตาเล็ดในการผจญภัยของสองแม่ลูก ภาคโรงเรียนที่รัก เริ่มต้นขึ้นแล้ว ณ บัดนี้!
                ',
                'image' => 'tsujo_2_cover.jpg',
                'stock' => 999,
                'price' => 228
            ],
            [
                'name' => '(LN) Special Set คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย เล่ม 3',
                'title' => 'คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย',
                'ProductCategoryID' => '2',
                'description' => '“หา? พูดว่าไง?” “เปล่านี่? ก็แค่บอกว่า หมอนี่โง่จริงๆเลย แค่นั้นเอง” “เลิกด่าเป็นภาษารัสเซียได้ไหม!?” คุณอาเรียยิ้มกริ่ม เธอคือสาวเจ้าของเรือนผมสีเงินผู้สวยไม่เป็นสองรองใครที่นั่งข้างผม... แต่ความจริงมันไม่ใช่อย่างนั้นเสียหน่อย ภาษารัสเซียที่เธอพูดเมื่อกี๊นี้มันคือ สนใจฉันหน่อย ต่างหากล่ะ! อันที่จริงตัวผม คุเซะ มาซาจิกะ มีทักษะการฟังภาษารัสเซียระดับเทียบเท่าเจ้าของภาษา เพียงแต่ไม่เปิดเผยเรื่องนั้นให้ใครรู้ วันนี้ก็เป็นอีกวันที่อดยิ้มไม่อยู่ เพราะคุณอาเรียมาหยอดคำหวานใส่เป็นภาษารัสเซียอีกแล้ว!? เรื่องราวเลิฟคอมเมดี้วัยใส กับนักเรียนสาวมัธยมปลายชาวรัสเซียผู้สวยเลิศเลอ จนเป็นที่หมายปองของใครต่อใคร!
                ',
                'image' => 'russia.jpg',
                'stock' => 999,
                'price' => 895
            ],
            [
                'name' => '(LN) ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน เล่ม 1',
                'title' => 'ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน',
                'ProductCategoryID' => '2',
                'description' => 'โรงเรียนมัธยมปลายโคโดอิคุเซ โรงเรียนชั้นนำของประเทศ ที่ตอบสนองความปรารถนาในการศึกษาต่อและการทำงานเกือบ 100 เปอร์เซ็นต์ แน่นอนว่ามีเครื่องอำนวยความสะดวกไว้ให้ใช้ครบครัน แถมยังให้เบี้ยเลี้ยง เป็นแต้มที่มีมูลค่าเท่ากับ 100,000 เยนทุกเดือนอีกด้วย ทั้งทรงผมหรือข้าวของส่วนตัวก็เลือกได้อย่างอิสระ ช่างเป็นโรงเรียนที่เหมือนกับสรวงสวรรค์เสียนี่กระไร แต่ในความเป็นจริงแล้วมีเพียงแค่นักเรียนที่มีความสามารถอย่างแท้จริงเท่านั้นที่จะได้รับการปฏิบัติเป็นพิเศษ ด้วยเหตุผลบางอย่าง อายาโนะโคจิ คิโยทากะ ถูกจัดให้มาอยู่ในห้อง D ที่รวมเอานักเรียนที่เหมือนของมีตำหนิถูกคนคอยล้อเลียนเอาไว้ด้วยกัน การพบเจอกับเพื่อนร่วมห้องอย่างโฮริคิตะ ซึซึเนะ สาวสวยผลการเรียนดี แต่นิสัยมีปัญหา และคุชิดะ คิเคียว สาวน้อยผู้โอบอ้อมอารี ใจดีอย่างกับนางฟ้า กำลังจะทำให้สถานการณ์ของคิโยทากะค่อยๆแปรเปลี่ยนไป...
                ',
                'image' => 'yokoso.jpg',
                'stock' => 999,
                'price' => 256
            ],
            [
                'name' => '(LN) มุมมองนักอ่านพระเจ้า เล่ม 6',
                'title' => 'มุมมองนักอ่านพระเจ้า',
                'ProductCategoryID' => '2',
                'description' => ' [สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ]
                คือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’
                เขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน
                และรู้ว่าเรื่องนี้จะจบลงอย่างไร
                .
                ดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย
                ท่ามกลางความหายนะต่างๆ นานา
                และ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์
                คิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน
                แต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน
                .
                โลกเปลี่ยนแปลงไปแล้ว
                และนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย
                ก็ค่อยๆ เปลี่ยนแปลงไป เพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน
                .
                ปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้ว
                คุณล่ะ … พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง',
                'image' => '6.jpg',
                'stock' => 999,
                'price' => 295
            ],

        ];
        foreach ($products as $key => $value) {
            Product::create($value);
        }
    }
}