<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Product;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $products = [

            [
                'name' => '(MG)ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'title' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา',
                'ProductCategoryID' => '1',
                'description' => 'ชีวิตไม่ต้องเด่น ขอแค่เป็นเทพในเงา เล่ม1',
                'image' => 'kage.jpg',
                'stock' => 999,
                'price' => 500
            ],
            [
                'name' => '(MG) ชีวิตไม่ง่ายของนางร้าย LV99 -ฉันคือบอสลับค่ะ ไม่ใช่จอมมาร- เล่ม 1',
                'title' => 'ชีวิตไม่ง่ายของนางร้าย LV99 -ฉันคือบอสลับค่ะ ไม่ใช่จอมมาร- เล่ม 1',
                'ProductCategoryID' => '1',
                'description' => 'เรื่อง: ซาโตริ ทานาบาตะ ฉันเกิดใหม่เป็นยูมิเอลา นางร้ายในเกมจีบหนุ่ม RPG แม้ตามเนื้อเรื่องจะเป็นตัวละครแสนจืดชืด แต่หลังฉากจบ ยูมิเอลาจะปรากฎตัวอีกครั้งในฐานะบอสลับแล้วเข้าห้ำหั่นกับผู้กล้า—กล่าวคือเก่งสุดๆ! ผลจากการฝึกฝนด้วยจิตวิญญาณเกมเมอร์อันพลุ่งพล่าน ตอนที่เข้าศึกษาในโรงเรียนฉันก็เลเวล 99 ไปซะแล้ว เดิมทีตั้งใจว่าจะใช้ชีวิตอย่างสงบสุขและไม่ข้องเกี่ยวกับเนื้อเรื่องเกม ทว่าเพราะความแตกเรื่องเลเวลตั้งแต่เข้าโรงเรียน เธอจึงถูกนางเอกกับพวกเป้าหมายในการจีบสงสัยว่าเป็นจอมมาร...!?
                ',
                'image' => '_m_akuyaku_reijo_mg_vol1_jacket_cover.jpg.jpg',
                'stock' => 999,
                'price' => 137.75
            ],

            [
                'name' => '(MG) บันทึกรักเจ้าหญิงหนอนหนังสือ เล่ม 1',
                'title' => 'บันทึกรักเจ้าหญิงหนอนหนังสือ',
                'ProductCategoryID' => '1',
                'description' => 'เอเลียนา บุตรีตระกูลมาร์ควิสผู้รักหนังสือใช้ชีวิตในฐานะคู่หมั้นในนามของเจ้าชายรัชทายาทคริสโตเฟอร์ 
                แต่อยู่มาวันหนึ่ง 
                เธอได้รู้ว่าเจ้าชายสนิทสนมกับคุณหนูคนหนึ่ง 
                ในที่สุดท่านก็มีสตรีในดวงใจแล้ว! 
                เอเลียนาคิดเช่นนั้นและเตรียมใจจะถอนหมั้นกับเขา ทว่า...

                เรื่องราวความรักแฟนตาซี มหากาพย์แห่งความเข้าใจผิดของคุณหนูหนอนหนังสือได้เบิกม่านขึ้นแล้ว!',
                'image' => '_m_mushi_kaburi_hime_vol1_jacket.jpg',
                'stock' => 999,
                'price' => 165
            ],
            [
                'name' => '(MG) ห้องเรียนจารชน เล่ม 2',
                'title' => 'ห้องเรียนจารชน',
                'ProductCategoryID' => '1',
                'description' => 'เพื่อเตรียมความพร้อมสำหรับ ‘ภารกิจเหลือวิสัย’

                ทีมสายลับสาวสวย ‘โทโมชิบิ’ จึงเริ่มฝึกต่อสู้จริงโดยมีเป้าหมายเป็นการเอาชนะเคลาส์
                
                ทว่านานวันเข้าพวกเธอก็เริ่มแคลงใจในเหตุผลที่พวกตนถูกเลือกมา
                
                จึงวางแผนลอบโจมตีด้วยเทคนิคยั่วสวาทเพื่อค้นหาความจริงนั้น—!?',
                'image' => '_m_spy_kyoshitsu_vol2_jacket_cover.jpg',
                'stock' => 999,
                'price' => 165
            ],
            [
                'name' => '(MG) ชะตาลิขิตให้ผมมาพิชิตเกมจีบหนุ่ม เล่ม 3',
                'title' => 'ชะตาลิขิตให้ผมมาพิชิตเกมจีบหนุ่ม',
                'ProductCategoryID' => '1',
                'description' => 'ทาโร่ (นามสมมติ) หนุ่มม.ปลายถูกส่งตัวมายังโลกของเกมจีบหนุ่มในฐานะนางเอก 

                ระหว่างกำลังปรับค่าความชอบของตัวละครจีบได้ที่มักจะเพิ่มขึ้น
                
                ผู้ที่ปรากฏตัวต่อหน้าทาโร่ซึ่งตามหาแหวนสำหรับพากลับโลกเดิมนั้นก็คือ ‘คุณหนูนางร้าย’!?
                
                เป้าหมายของเธอที่รู้ว่าทาโร่คือ ‘นางเอก’ คืออะไรกัน!? 
                
                การ์ตูนผจญภัยต่างโลกสุดฮาที่ตัวเอกไม่ได้อยากจะเทพเลย เล่ม 3 มาให้อ่านกันแล้ว!!  ',
                'image' => '_m_otomegame_tenso_vol3_jacket_cover_1_1_.jpg',
                'stock' => 999,
                'price' => 173
            ],
            [
                'name' => '(MG) เพื่อนแฟนแทนกันได้ เล่ม 1',
                'title' => 'เพื่อนแฟนแทนกันได้',
                'ProductCategoryID' => '1',
                'description' => 'ทาเครุเพิ่งเริ่มคบหากับคาโอริ แฟนสาวคนแรก

                ทว่าขณะที่ทั้งสองกำลังจะไปเดตกัน
                
                โยชิโอกะ เพื่อนสาวของคาโอริก็ขอตามไปด้วย
                
                แถมยังอ่อยทาเครุหนักมากยิ่งกว่าแฟนตัวจริงเสียอีก...!
                
                เรื่องราวความรักพิสดารที่จะกระตุกจิตกระชากใจคุณ เปิดฉากขึ้นแล้ว',
                'image' => '_m_kanojo_no_tomodachi_vol1_jacket_1_.jpg',
                'stock' => 999,
                'price' => 185
            ],
            [
                'name' => '(MG) 9 สิงหา ผวารักวิปริต เล่ม 3',
                'title' => '9 สิงหา ผวารักวิปริต',
                'ProductCategoryID' => '1',
                'description' => 'เมื่อความรักและกามารมณ์ผสานเข้าด้วยกัน ความจริงบางอย่างจึงได้ปรากฏ
                .
                ซากุราอิเป็นเด็กหนุ่ม ม.ปลายที่ถูกเหล่าปีศาจจากตำนานเมืองทั่วญี่ปุ่นหลงรักและตามรังควาน 
                หลังการต่อสู้กับยาเอะซึ่งเป็นท่านฮัชชาคุจบลง การเข่นฆ่าที่เกิดขึ้นรอบตัวซากุราอิก็ดูเหมือนจะสงบลงด้วย และในวันหนึ่ง 
                ซากุราอิที่ปฏิเสธการไปโรงเรียนมาเนิ่นนานก็ตัดสินใจกลับไปเรียนอีกครั้ง เมื่อไปถึงห้องเรียนด้วยความกังวล 
                เขาก็ได้พบว่าอุชิมิที่น่าจะถูกมิยาโกะฆ่าไปแล้วยังมีชีวิตอยู่...!? ระหว่างนั้นปีศาจตนใหม่ก็ได้เริ่มเคลื่อนไหวเช่นกัน จะมีสิ่งใดรอซากุราอิอยู่กันแน่!!!',
                'image' => '_m_hachigatsu_kokonoka_vol3_jacket_1_.jpg',
                'stock' => 999,
                'price' => 199
            ],
            [
                'name' => '(MG) เพราะรักนี้ไม่ได้มีแค่สองเรา เล่ม 1',
                'title' => '',
                'ProductCategoryID' => '1',
                'description' => '"แต่ว่าฉันมีแฟนอยู่แล้ว"
                .
                นานาเสะกับยูนิแอบคบกันอยู่โดยที่ไม่มีใครรู้ ยูนิเข้าใจดีว่าคนรักยุ่งกับชมรมวอลเลย์บอล จึงอดทนใช้เวลาหลังเลิกเรียนอย่างเดียวดาย แม้ใจจะรู้สึกเหงา
                .
                เธอนำเรื่องความรักที่บอกใครไม่ได้ระบายลงแอคหลุม ทั้งเซลฟี ทั้งบ่น รวมถึงอวดแฟนนิดหน่อย เพียงเพราะต้องการเล่าให้ใครสักคนฟัง
                .
                แต่เมื่อมีคนในโรงเรียนรู้ความลับนี้ ยูนิจึงไม่ใช่คนรักของนานาเสะเพียงคนเดียวอีกต่อไป',
                'image' => '_mg_kyo_wa_kanojo_ga_inai_kara_vol1_jacket_1_.jpg',
                'stock' => 999,
                'price' => 200
            ],
            [
                'name' => '(MG) WIND BREAKER วินด์เบรกเกอร์ เล่ม 4',
                'title' => 'WIND BREAKER วินด์เบรกเกอร์',
                'ProductCategoryID' => '1',
                'description' => '
                เรื่อง:

                หลังจากเข้าเรียนที่โรงเรียนมัธยมปลายฟูริน
                ศูนย์รวมของเหล่านักเ(ก)รียนสุดแกร่งและวีรชนผู้พิทักษ์เมือง
                ซากุระก็ยังคงหมายมั่นจะก้าวขึ้นสู่จุดสูงสุดของที่นั่น
                แม้จะถูกรายล้อมไปด้วยพรรคพวกที่เก่งกาจ
                หลังเปิดศึกดวลเดือดกับผู้ศรัทธาเพียงพลัง ‘ชิชิโท’ โดยมีทีมเป็นเดิมพัน
                ในที่สุดศึกชี้ขาดระหว่างผู้เป็นจุดสูงสุดของทั้งสองฝ่ายก็มาถึง
                คำตอบของอุเมมิยะที่มีให้แก่โทมิยามะผู้ยึดติดกับพลังและอาละวาดไปทั่วนั้นคือ—!
                
                โบฟูริน
                
                จงช่วยราชสีห์ผู้โดดเดี่ยว!
                ผู้ที่ลุกขึ้นเผชิญหน้าคือชายผู้แกร่งที่สุดใน ‘โบฟูริน’ อุเมมิยะ ฮาจิเมะ!!',
                'image' => '_m_wind_breaker_vol4_jacket.jpg',
                'stock' => 999,
                'price' => 205
            ],
            [
                'name' => '(MG) มหาศึกคนชนเทพ เล่ม 14',
                'title' => 'มหาศึกคนชนเทพ',
                'ProductCategoryID' => '1',
                'description' => '
                ...เรื่องย่อ...
                .
                ศึกรอบที่ 6 การต่อสู้ระหว่างเทพ vs เทพที่ไม่เคยเกิดขึ้นมาก่อนเป็นอันสิ้นสุดลง และศึกรอบที่ 7 ก็เปิดฉาก
                ท่ามกลางความลุ้นระทึกที่ยังคงคุกรุ่น!! ตัวแทนมนุษย์คือปฐมจักรพรรดิจิ๋นซีฮ่องเต้!! ในขณะที่ตัวแทนฝ่ายเทพได้แก่…',
                'image' => '_m_record_of_ragnarok_vol14_jacket_cover_1_.jpg',
                'stock' => 999,
                'price' => 179
            ],
            [
                'name' => '(LN) คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ เล่ม 2',
                'title' => 'คุณแม่ที่มีสกิลพื้นฐานเป็นการโจมตีหมู่แถมยังเบิ้ลได้แบบนี้ชอบไหมจ๊ะ',
                'ProductCategoryID' => '2',
                'description' => '“ดูสิๆ ม่าคุง คุณแม่ทำสำเร็จแล้วละจ้ะ!” “...นี่นาย” “...อย่าพูดนะ เดี๋ยวได้ร้องไห้กันพอดี” มารดาที่ตามติดเข้ามาในเกมอย่างมามาโกะช่างแข็งแกร่งเป็นที่สุด... แข็งแกร่งเกินไปจนพวกลูกๆ อย่างมาซาโตะแทบหมดคุณค่าในการมีชีวิตอยู่ พวกเขาจึงตัดสินใจทำเควสต์เข้าโรงเรียนเพื่อให้ได้รับไอเท็มเสริมแกร่งมาไว้ในครอบครอง มาซาโตะใจเต้นไม่เป็นส่ำเมื่อได้รู้จักกับเมดี้ สาวน้อยจอมเวทรักษา ชั่วขณะที่คิดว่าจะได้ใช้ชีวิตรักวัยรุ่นสุดละมุนให้สมเป็นเด็กหนุ่มวัยกำลังโตเสียที... “คุณแม่ลองใส่ดูน่ะจ้ะ เป็นไงจ๊ะ เข้ากันไหมเอ่ย” มามาโกะก็ยังตามมาเข้าเรียนด้วยอยู่ดี!? ใส่ชุดนักเรียนกะลาสีมาเข้าร่วมคาบเรียนไม่พอ ยังใส่ชุดว่ายน้ำโรงเรียนปรากฏตัวขึ้นที่สระว่ายน้ำอีก!? คุณแม่โซฮ็อตจนเหล่าเด็กผู้ชายพากันแย่งสารภาพรัก ซ้ำยังลงประกวดเวทีนางงามในเทศกาลโรงเรียน!? เบื้องหลังความวายป่วงของมารดาที่พาลูกชายอยากร่ำไห้ เมดี้คนสวยที่มาซาโตะแอบปลื้มยังแบกรับความกลัดกลุ้มด้วยปัญหามารดาอยู่ในใจ... แล้วมีหรือที่ผู้กล้าอย่างมาซาโตะจะยอมเพิกเฉย! ...แน่นอน คุณแม่ของผู้กล้าอย่างมามาโกะก็เช่นกัน เรื่องราวซาบซึ้งสุดฮาชวนน้ำตาเล็ดในการผจญภัยของสองแม่ลูก ภาคโรงเรียนที่รัก เริ่มต้นขึ้นแล้ว ณ บัดนี้!
                ',
                'image' => 'tsujo_2_cover.jpg',
                'stock' => 999,
                'price' => 228
            ],
            [
                'name' => '(LN) Special Set คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย เล่ม 3',
                'title' => 'คุณอาเรียโต๊ะข้างๆ พูดรัสเซียหวานใส่ซะหัวใจจะวาย',
                'ProductCategoryID' => '2',
                'description' => '“หา? พูดว่าไง?” “เปล่านี่? ก็แค่บอกว่า หมอนี่โง่จริงๆเลย แค่นั้นเอง” “เลิกด่าเป็นภาษารัสเซียได้ไหม!?” คุณอาเรียยิ้มกริ่ม เธอคือสาวเจ้าของเรือนผมสีเงินผู้สวยไม่เป็นสองรองใครที่นั่งข้างผม... แต่ความจริงมันไม่ใช่อย่างนั้นเสียหน่อย ภาษารัสเซียที่เธอพูดเมื่อกี๊นี้มันคือ สนใจฉันหน่อย ต่างหากล่ะ! อันที่จริงตัวผม คุเซะ มาซาจิกะ มีทักษะการฟังภาษารัสเซียระดับเทียบเท่าเจ้าของภาษา เพียงแต่ไม่เปิดเผยเรื่องนั้นให้ใครรู้ วันนี้ก็เป็นอีกวันที่อดยิ้มไม่อยู่ เพราะคุณอาเรียมาหยอดคำหวานใส่เป็นภาษารัสเซียอีกแล้ว!? เรื่องราวเลิฟคอมเมดี้วัยใส กับนักเรียนสาวมัธยมปลายชาวรัสเซียผู้สวยเลิศเลอ จนเป็นที่หมายปองของใครต่อใคร!
                ',
                'image' => 'russia.jpg',
                'stock' => 999,
                'price' => 895
            ],
            [
                'name' => '(LN) ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน เล่ม 1',
                'title' => 'ขอต้อนรับสู่ห้องเรียนนิยม (เฉพาะ) ยอดคน',
                'ProductCategoryID' => '2',
                'description' => 'โรงเรียนมัธยมปลายโคโดอิคุเซ โรงเรียนชั้นนำของประเทศ ที่ตอบสนองความปรารถนาในการศึกษาต่อและการทำงานเกือบ 100 เปอร์เซ็นต์ แน่นอนว่ามีเครื่องอำนวยความสะดวกไว้ให้ใช้ครบครัน แถมยังให้เบี้ยเลี้ยง เป็นแต้มที่มีมูลค่าเท่ากับ 100,000 เยนทุกเดือนอีกด้วย ทั้งทรงผมหรือข้าวของส่วนตัวก็เลือกได้อย่างอิสระ ช่างเป็นโรงเรียนที่เหมือนกับสรวงสวรรค์เสียนี่กระไร แต่ในความเป็นจริงแล้วมีเพียงแค่นักเรียนที่มีความสามารถอย่างแท้จริงเท่านั้นที่จะได้รับการปฏิบัติเป็นพิเศษ ด้วยเหตุผลบางอย่าง อายาโนะโคจิ คิโยทากะ ถูกจัดให้มาอยู่ในห้อง D ที่รวมเอานักเรียนที่เหมือนของมีตำหนิถูกคนคอยล้อเลียนเอาไว้ด้วยกัน การพบเจอกับเพื่อนร่วมห้องอย่างโฮริคิตะ ซึซึเนะ สาวสวยผลการเรียนดี แต่นิสัยมีปัญหา และคุชิดะ คิเคียว สาวน้อยผู้โอบอ้อมอารี ใจดีอย่างกับนางฟ้า กำลังจะทำให้สถานการณ์ของคิโยทากะค่อยๆแปรเปลี่ยนไป...
                ',
                'image' => 'yokoso.jpg',
                'stock' => 999,
                'price' => 256
            ],
            [
                'name' => '(LN) มุมมองนักอ่านพระเจ้า เล่ม 6',
                'title' => 'มุมมองนักอ่านพระเจ้า',
                'ProductCategoryID' => '2',
                'description' => ' [สามวิธีการเอาชีวิตรอดในโลกที่ล่มสลาย ]
                คือชื่อของนิยายออนไลน์กว่าสามพันตอนที่มีเขาเป็นผู้อ่านแค่ ‘คนเดียว’
                เขารู้เรื่องราวทั้งหมดของมัน รู้ว่าแต่ละฉากจะดำเนินไปแบบไหน
                และรู้ว่าเรื่องนี้จะจบลงอย่างไร
                .
                ดังนั้น…เมื่อจู่ๆ โลกใบนี้ก็เปลี่ยนไป กลายเป็นเหมือนกับในนิยาย
                ท่ามกลางความหายนะต่างๆ นานา
                และ ‘ซีนาริโอ’ ที่เข้ามาท้าทายเหล่ามนุษย์
                คิมดกจาจึงรู้ดีว่าจะผ่านเงื่อนไขแต่ละฉากไปได้ด้วยวิธีไหน
                แต่การ ‘รู้’ กับการ ‘ทำได้จริง’ ก็เป็นคนละเรื่องกัน
                .
                โลกเปลี่ยนแปลงไปแล้ว
                และนิยายที่เคยมีเขาเป็นผู้อ่านเพียงหนึ่งเดียวจนถึงบทสุดท้าย
                ก็ค่อยๆ เปลี่ยนแปลงไป เพราะมีเขาเข้ามาเป็นตัวแปรเช่นกัน
                .
                ปฐมบทของนิยายเรื่องนี้เริ่มขึ้นแล้ว
                คุณล่ะ … พร้อมเข้าไปในนิยายเรื่องนี้แล้วหรือยัง',
                'image' => '6.jpg',
                'stock' => 999,
                'price' => 295
            ],
            [
                'name' => '(LN) อาจารย์เวทมนต์ไม่เอาไหนกับตำนานปราสาทลอยฟ้า เล่ม 16',
                'title' => 'อาจารย์เวทมนต์ไม่เอาไหนกับตำนานปราสาทลอยฟ้า',
                'ProductCategoryID' => '2',
                'description' => '
                คณะตัวแทนของจักรวรรดิอัลซาโนผ่านเข้าสู่รอบรองชนะเลิศของมหกรรมเวทมนตร์ การได้พบพานกับซาคุยะ เมนวิเซิร์ดของประเทศอาทิตย์อุทัย ส่งผลให้การเตรียมใจในฐานะนักเวทของซิสตินาถูกทดสอบขึ้นมา—การเตรียมใจให้ที่พร้อมที่จะเหยียบย่ำความปรารถนาของผู้อื่นเพื่อความปรารถนาของตนเอง ดังคำซึ่งกล่าวไว้ว่า ‘แม้นปรารถนา จงโยนปรารถนาของผู้อื่นลงกองเพลิง’—

                อีกด้านหนึ่ง ในที่สุดเกลนก็ถอดรหัสสมุดบันทึกของจักรพรรดินีอลิเซียที่ 3 จนสำเร็จ ทำให้เขาเข้าใกล้ความจริงเรื่อง ‘พลังเหนือธรรมชาติของลูเมีย’ ‘สมาคมวิจัยภูมิปัญญาแห่งสวรรค์’ ‘โปรเจ็กต์: รีไวฟ์ไลฟ์’—และรวมไปถึงปริศนาคัมภีร์ต้องห้ามอคาชิคเรคอร์ดมากขึ้นทุกขณะ
                
                ท่ามกลางความควาดหวังและความสับสนของเหล่านักเวท เมื่อมหกรรมเวทมนตร์เดินทางมาถึงรอบชิง ประกายไฟที่จะสั่นสะเทือนทั้งโลกได้ปะทุขึ้น!',
                'image' => 'rokudenashi_vol16_jacket.jpg',
                'stock' => 999,
                'price' => 300
            ],
            [
                'name' => '(LN) ซาซากิกับพีจัง เล่ม 2',
                'title' => 'ซาซากิกับพีจัง',
                'ProductCategoryID' => '2',
                'description' => '
                หลังซาซากิได้รับโอกาสข้ามโลกกับพลังเวทมนตร์ทรงอานุภาพจากปราชญ์ดวงดาวพีจัง (นกกระจอกชวาที่เป็นสัตว์เลี้ยง) 
                พวกเขาทั้งสองก็อาศัยความแตกต่างทางค่านิยมกับอารยธรรม แสวงหากำไรจากต่างโลก → ใช้ชีวิตสโลว์ไลฟ์ เรื่อยเปื่อย 
                ทว่าเรื่องกลับไม่ราบรื่นอย่างที่มุ่งหวัง เมื่อสาวน้อยเวทมนตร์กับผู้มีพลังพิเศษเข้ามาทำให้แผนพังไม่เป็นท่า ซ้ำร้ายยังเกิดเหตุขึ้นที่ต่างโลกด้วย 
                อุตส่าห์ได้เป็นเจ้าหน้าที่ของรัฐทั้งที แต่กลับต้องมาชิงไหวพริบกับเจ้านายให้เหนื่อยใจ แถมรุ่นพี่ที่ทำงาน (สาว ม.ปลายและผู้มีพลังพิเศษ) 
                ซึ่งเป็นคู่หูยังขยันหาเรื่องมาให้ทุกวันอีก กระทั่งอยู่มาวันหนึ่ง ระหว่างซาซากิกำลังใช้เวทมนตร์ต่างโลกทำศึกดวลพลัง 
                สาวน้อยเวทมนตร์ก็โผล่มาแบบเหนือเมฆแล้วเข้าจู่โจมจนเกมพลิก 
                นอกจากนี้ ภายในยังมีเนื้อหาสดใหม่ซึ่งไม่เคยเปิดเผยที่ไหนมาก่อนให้อ่านถึงครึ่งเล่ม! 
                ไม่ว่าจะเป็น ตอนฟุตาริชิสึกะบอกว่าอยากเข้าร่วมกรมควบคุมปรากฏการณ์เหนือธรรมชาติ 
                สำนักนายกรัฐมนตรี ตอนมีคนปะปนกับสิ่งของเข้ามายังโลกปัจจุบัน และตอนคุณเพื่อนบ้านได้ยินเสียงเพรียกจากมาร 
                จนรอบตัวสาวน้อยเวทมนตร์ (?) อย่างซาซากิแออัดไปด้วยความโกลาหล—!',
                'image' => '_ln_sasaki_to_pichan_vol_2_jacket_1__1.jpg',
                'stock' => 999,
                'price' => 365
            ],
            [
                'name' => '(LN) ไม่มีใครรู้ว่าเราทำอะไรกันในห้องเธอ เล่ม 1',
                'title' => 'ไม่มีใครรู้ว่าเราทำอะไรกันในห้องเธอ',
                'ProductCategoryID' => '2',
                'description' => '
                “หลังจากนี้มาที่บ้านฉันมั้ย...อยากจะมีอะไรกับนายน่ะ"
                เด็กจืดจางในห้องเรียนอย่างโทยามะ ยูกิ มีความลับที่ไม่ได้บอกใครอยู่ นั่นคือความสัมพันธ์แบบ ‘เพื่อนเฉพาะกิจ’ ของเขากับเพื่อนร่วมห้องทาคาอิ ยูมิ 
                ที่ทั้งคู่จะไม่ข้องแวะกันแม้แต่นิดนอกจากเวลาทำกิจกรรมลับที่ห้องของเธอ
                จนวันหนึ่ง โทยามะถูกสาวป็อปประจำห้องอย่างอุเอฮาระ มาริกะ มาพบเข้าในจังหวะที่ซื้อถุงยางอนามัย  
                จากความสงสัยกลายเป็นความสนใจ เธอเริ่มเข้ามาพูดคุยกับเขาทั้งช่วงพักเที่ยงและหลังเลิกเรียน
                เมื่อยูมิเห็นโทยามะแสดงอาการสับสนแต่ดูเหมือนดีใจอยู่ลึกๆ เธอก็รู้สึกถึงความรักที่ตนมีต่อโทยามะ จนแม้แต่ในโรงเรียนก็อดใจไว้ไม่ไหวเสียแล้ว!?
                เลิฟคอเมดีวุ่นๆของหนุ่มจืดจางจึงได้เริ่มต้นขึ้น—',
                'image' => '_ln_saenaiboku_vol1_jacket_1_.jpg',
                'stock' => 999,
                'price' => 295
            ],
            [
                'name' => '(LN) ซ่อนคมเวทเจ็ดดาบมาร เล่ม 9',
                'title' => 'ซ่อนคมเวทเจ็ดดาบมาร',
                'ProductCategoryID' => '2',
                'description' => 'ลีกการประลองยุทธ์เข้าสู่รอบชิงชนะเลิศ 

            เปิดฉากการเผชิญหน้าระหว่างเหล่าผู้แข็งแกร่ง
            
            เพื่อแสดงพัฒนาการของตนให้คู่แข่งได้เห็น
            
            เพื่อปฏิเสธวิถีการมีอยู่ของอีกฝ่าย
            
            เพื่อให้ได้อยู่ด้วยกันกับอีกครึ่งของชีวิตต่อไป
            
            พวกเขาต่างต่อสู้ด้วยความปรารถนาที่เก็บไว้ในใจ
            
            แต่แล้วดวงตาของดิมิทรีโอ้ก็ส่องประกายขึ้น
            
            ท่ามกลางเหล่าผู้ชมที่กำลังตื่นตัวไปกับการต่อสู้อันดุเดือด',
                'image' => '_ln_nanatsu_no_maken_vol9_jacket_cover.jpg',
                'stock' => 999,
                'price' => 298
            ],
            [
                'name' => '(LN) ใครว่าข้าไม่เหมาะเป็นจอมมาร เล่ม 9',
                'title' => 'ใครว่าข้าไม่เหมาะเป็นจอมมาร',
                'ProductCategoryID' => '2',
                'description' => 'อานอสโค่นศัตรูตัวฉกาจอย่างกราแฮม ชำระแค้นให้บิดา และได้ความทรงจำที่สูญเสียไปส่วนใหญ่คืนมาจาก ‘ดาราอุบัติเอเรียล’ 
            ทว่าดันเกิดความผิดปกติกับซาชาที่รับฝากดาราอุบัติดวงสุดท้ายไว้
            .
            
            “ฉันคือเทพทำลายล้างอาเบลนิว”
            .
            อาจด้วยอิทธิพลจากดาราอุบัติ ซาชาประกาศว่าตนคือเทพทำลายล้างกลับชาติมาเกิด 
            พวกอานอสจึงเริ่มสำรวจปราสาทจอมมารตามความทรงจำของเธอที่หวนคืนมาบางส่วนเพื่อพิสูจน์ความจริง 
            แล้วก็พบร่องรอยที่เทพทำลายล้างทิ้งไว้ทั่วทุกหนแห่งในปราสาท—
            .
            เทพผู้สร้างที่รังสรรค์โลกและเทพทำลายล้างซึ่งเป็นพี่น้องกับเธอ ความลับของสองเทพเจ้าเสาหลักจะถูกเปิดเผย ณ บัดนี้!
            .
            ขอเชิญพบกับเล่ม 9 ภาค ‘ปริศนาปราสาทจอมมาร’!!',
                'image' => '_ln_maou_gaku_vol9_jacket_cover.jpg',
                'stock' => 999,
                'price' => 295
            ],
            [
                'name' => '(LN) ถ้ามีเธออยู่ เป็นหมูก็ไม่เลวนะครับ เล่ม 2',
                'title' => 'ถ้ามีเธออยู่ เป็นหมูก็ไม่เลวนะครับ',
                'ProductCategoryID' => '2',
                'description' => 'ผมกลับมาเยือนดินแดนแห่งดาบและเวทมนตร์อีกครั้งในร่างหมู! 
                ทว่าตัวหลักอย่างเจสกลับไม่อยู่แล้ว ทำไมกัน! ยังดีที่ได้มาเจอหนูน้อยโลลิเซเรส...ไม่สิ 
                ผมไม่ได้มาหาสาวสักหน่อย ดูเหมือนว่าตอนนี้เมสเทเรียกำลังตกอยู่ในสงครามที่แบ่งเป็นสามขั้ว 
                ผมกับสหายหมูต่างมิติจึงต้องร่วมมือกับนายพรานสุดหล่ออย่างน็อต
                เพื่อปลดแอกเยสม่าให้หลุดพ้นจากชะตากรรมอันแสนโหดร้าย
                .
                มะ...ไม่ใช่ว่าผมคิดถึงเจสใจจะขาดแล้วหรอกนะ ไม่ใช่เพราะเหตุผลนั้นแน่นอน!
                .
                นี่ผมจะได้เจอกับเจสอีกมั้ยนะ…',
                'image' => '_ln_buta_no_liver_wa_kanetsushiro_vol_2_jacket_1_.jpg',
                'stock' => 999,
                'price' => 320
            ],

        ];
        foreach ($products as $key => $value) {
            Product::create($value);
        }
    }
}